<?php
$this->pageTitle=Yii::app()->name . ' - О нас';
$this->breadcrumbs=array(
	'О нас',
);
?>
<h1>О проекте</h1>

<p id=ubuntulink align="justify">
<a>Преимущества при использовании СПО</a>
<ol start=1>
<li>Отсутствие лицензионных выплат за использование программного обеспечения и соответственно отсутствие рисков, связанных с возможными проверками проверяющих органов на лицензионную «чистоту».</li> 
<li>Операционную систему и программы, которые учитель или преподаватель использует в учебном процессе, может так же свободно и без ограничения использовать у себя дома.</li>
<li>Ввиду того, что парк компьютеров имеет в своём составе довольно много старых и маломощных системных блоков, то открывается возможность продлить срок их «программной жизни» без дополнительных затрат. Производные от Ubuntu хорошо работают и на старых маломощных компьютерах. В Windows 7 у Вас не будет ни единого шанса для работы с этим оборудованием, потребуется самое современное и мощное оборудование и, соответственно придётся нести затраты.</li>
<li>Так как исходный код Linux и программ открыт, то работая в Linux ученики становятся очень опытными компьютерными пользователями. Всегда можно изучить как работает программа и возможно улучшить её.</li> 
<li>В Ubuntu Linux сохраняется преемственность по совместимости драйверов периферийных устройств. В Windows – никакой преемственности драйверов нет, и может получиться, что Ваше оборудование так и не заработает в новых версиях Windows.</li>
<li>После установки Ubuntu Linux в подавляющем большинстве случаев всё оборудование устанавливается сразу и готово к работе, не требуется огромное количество дисков с драйверами. Если ядро Linux знает эту оборудование, то оно будет установлено автоматически.</li>
<li>Отсутствие вирусов и троянских программ. Высочайшая надёжность и защищённость серверов и рабочих станции, работающих по управлением Linux. Таким образом это позволяет отказаться от использования антивирусных программ.</li>
<ol>
</p>
<p id=ubuntulink align="justify">
Особо хочется отметить <a>важность использования операционной системы Ubuntu в компьютерных классах.</a> 
В школьных компьютерных классах, как правило, установлено от 10-30 рабочих мест. Вопрос непрерывного 
эксплуатирования таких компьютеров стоит очень остро. Известная проблема с вирусами, сбоями в операционной 
системе Windows, а так же постоянная проблема с лицензиями, будет решена сразу после установки операционной системы Ubuntu. 
Для полноценного изучения предмета информатики в Ubuntu есть всё необходимое. Ubuntu распространяется бесплатно, 
быстро устанавливается и обновляется, и, в добавок ко всему, имеет репутацию легендарной надёжности и  быстроты 
работы, имеет дружественный к пользователю интерфейс и отсутствует уязвимость в вирусам.
Почти всегда пользователи опасаются, что не будет работать установленное у них оборудование: принтеры, сканеры. 
Страх производит представление о том, что будет использоваться OpenOffice.org или LibreOffice и не будет возможности 
воспроизводить методический материал в новой системе. Возникают опасения, что они останутся наедине со своими проблемами и 
никто им не поможет. Именно при использовании Ubuntu подавляющее большинство оборудования будет работать практически сразу или, 
по крайней мере, можно будет всегда найти драйвер для устройства. Подавляющее большинство документов, созданных в MS Office 
будут корректно открываться в современных версиях LibreOffice. А возникшие вопросы или проблемы будут решены нашими 
специалистами по технической поддержке. Мы понимаем как важно чувствовать и знать, что Вы не одни и что Вам всегда 
помогут на высоком техническом уровне.<br>
Часто встречается ситуация, , что применение СПО затруднено тем, что преподаватели и сотрудники используют у себя на 
домашних компьютерах и ноутбуках MS Office, который в большинстве случаев является не лицензионным. Ничто не мешает 
установить на эти компьютеры LibreOffice и делать совместимые документы, которые на работе будут открываться и работать 
так же как у них дома. Таким образом решится проблема не лицензионного программного обеспечения на компьютерах преподавателей.
 А ведь это нарушение уголовного кодекса со статьёй 146 УК РФ (Нарушение авторских и смежных прав) и 4 главы Гражданского 
кодекса РФ (Права на результаты интеллектуальной деятельности и средства индивидуализации) где наказанием может быть и 
штраф и условная судимость и реальные сроки заключения. 
Соблюдение закона и стремление к совершенствованию в овладении программным обеспечением учителем и преподавателем 
служит отличным примером для всех учащихся и подчёркивает важность использования СПО.
А в конечном итого это значительно расширит кругозор самих учителей и учащихся. В ряде случаев требуется некоторый 
период обучения и мы готовы профессионально провести такую услугу.
<br>
Чтобы организовать одно рабочее место на базе MS Windows с применением проприетарного программного обеспечения требуется 
потратить от 20 тыс. рублей до 70 тыс. руб.
Существующая на сегодняшний день система лицензирования – очень затратна и не подходит большинству учебных заведений, 
где каждый год придётся закупать лицензии. С переходом на работу в СПО такие затраты отсутствуют. 
Для того, чтобы снизить риски при миграции на СПО и при его использовании быть уверенными что будет оказана помощь и 
консультации предлагается информационная и техническая поддержка СПО на базе Ubuntu Linux. Для этого заключается договор 
на обслуживание СПО с образовательными учреждениями. При этом каждое образовательное учреждение может выбрать свой вариант 
и «глубину» поддержки. Необходимо определить сколько единиц техники с программным обеспечением и периоды времени, в течение 
которого необходимо решить возникшую проблему, а так же определить насколько критично временное ожиданию решения проблемы.
Срок действия зависит от типа договора и уровня технической поддержки. Срок действия технической поддержки отсчитывается с 
момента первого обращения.
<br><br>
<a>Что включает в себя поддержка?</a><br>
Поддержка осуществляется по электронной почте, по телефону и с выездом специалиста. 
Варианты поддержки пользователей образовательных учреждений приведены ниже в  таблице.
</p>
<div class=ubuntulink>
<table>
<tr><th>№ п.п.</td><th>Вид технической поддержки</th><th>Стоимость услуги, руб.</th></tr>
<tr><td>1</td><td>Техническая и информационная поддержка на период 1 месяц. 10 рабочих станций или один компьютерный класс (первичная установка программного обеспечения, краткое обучение).</td><td>1000 руб.</td></tr>
<tr><td>2</td><td>Консультационно-информационная поддержка Ubuntu на основе абонентской платы без выезда к заказчику. Делается запрос по телефону или по электронной почте. Выполнение запроса не более двух рабочих дней. </td><td>250  руб./1 компьютер в год</td></tr>
<tr><td>3</td><td>Техническая и консультационно-информационная поддержка парка компьютеров на основе абонентской платы с выездом к заказчику.</td><td>500 руб./1 компьютер в год</td></tr>
<tr><td>4</td><td>Тех. поддержка на основе разовых вызовов специалиста на место для решения проблемы.</td><td>200 руб. за выезд плюс каждый час работы 100 руб.</td></tr>
<tr><td>5</td><td>Установка и настройка Ubuntu в качестве рабочей станции для продвинутых пользователей на одно рабочее место (установка и настройка ОС, поддержка основного функционала (интернет, создание документов, мультимедиа, печать, сканирование и другое по запросу пользователя) </td><td>500 руб.</td></tr>
<tr><td>6</td><td>Установка Ubuntu Server и «Школьный портал»</td><td>700 руб.</td></tr>
<tr><td>7</td><td>Установка и настройка Ubuntu Server как шлюза доступа в интернет со всеми службами (Web-server, почтовый сервер, Jabber, ftp-server, интернет шлюзы, прокси сервер, фильтрация контента)</td><td>1 500 руб. (Обслуживание через удалённый доступ 300 руб./1 сервер в мес.)</td></tr>
<tr><td>8</td><td>Обучение пользователей основам работы в ОС Ubuntu (8 часовой курс)</td><td>500 руб./за 1 чел.</td></tr>
</table>
</div>
<p id=ubuntulink align="justify">
<a>Обратите внимание на п.1, это может быть это очень выгодное предложение для Вашей организации. Перевод рабочих мест 
компьютерного класса на новую систему не  ведёт ни к каким рискам, а только  даст общее представление о продукте и возможность 
опробовать новую систему и затем принять решение о миграции других рабочих мест. Те есть, если у Вас уже установлена Windows 
(но сроки лицензий истекают или ограничены), то можно установить вторую операционную систему и появится возможность плавного
перехода и изучения новой системы без удаления старой.</a>
Обширный практический опыт внедрений позволяет нам производить миграцию с Вашей Windows инфраструктуры на платформу 
Linux или на смешанную (гетерогенную) инфраструктуру быстро и безболезненно.
Поддержка и консультации по вопросам использования ОС Ubuntu Linux – не исчерпывает всех наших предложений. Вот перечень 
наших услуг:

<li>Web-разработка ПОРТАЛОВ на основе современных технологий. Создание и функционирование Web-приложений при помощи свободных технологий на базе Linux;</li>
<li>Обучение работе в СПО на базе Ubuntu;</li>
<li>Обслуживание программного обеспечения;</li>
<li>Создание репозитория программного обеспечения и многое другое.</li>

</p>
<p id=ubuntulink align="justify">
<a>Сборка Ubuntu for Teachers на базе Ubuntu 10.04 LTS</a> – наиболее часто устанавливаемый и любимый дистрибутив для 
образовательных и не только учреждений. По желанию так же возможно установит самую новую версию Ubuntu 12.04 в том случае, 
если аппаратное обеспечение это позволяет. 
Если компьютеры в классах достаточно старые и маломощные, то и для них найдётся решение: либо устанавливается 
облегчённая версия Ubuntu, либо возможно создание из них «тонких клиентов» с загрузкой по сети.
В комплект установки Ubuntu for Teachers входит следующее программное обеспечение:

<br><a>ГРАФИЧЕСКИЕ ПРИЛОЖЕНИЯ</a><br>
GIMP - растровый редактора<br>
InkScape - векторный редактор<br>
Blender - среда 3D-моделирования и анимации <br>
Scribus - издательская система<br> 
mtPaint - программа рисования<br>
<a>ПРОГРАММИРОВАНИЕ</a><br>
FreePascal - язык программирования<br>
Basic256 - язык программирования в IDE для написания программ на Basic<br>
Lazarus - среда разработки графических приложений на языке Pascal (совместима с Delphi)<br>
GamBas2 - среда разработки графических приложений на языке ObjectBasic (аналог VisualStudio)<br>
Geany - среда разработки приложений на различных языках программирования (поддерживается подсветка кода и компиляция программ на pascal, C, C++, HTML, JavaScript и других)<br>
Kompozer - WISIWIG среда создания web-страниц (аналог PageMaker) <br>
<a>ОФИСНЫЕ ПРИЛОЖЕНИЯ, СИСТЕМНЫЕ УТИЛИТЫ</a><br>
OpenOffice.org (по выбору LibreOffice) – полнофункциональный офисный пакет включающий (Writer, Calc, Impress, Math, Base, Draw).<br>
YAGF (CuneiForm)- система распознавания текста с сканированных документов (поддерживает русский язык) <br>
Adobe Reader  программа для просмотра и распечатки документов в PDF-формате<br>
Evince — программа для просмотра и распечатки документов в графических форматах и формате PDF.<br>
PeaZip — мощная среда архивирования<br>
Ubuntu Tweak - инструмент для Ubuntu, который позволяет с лёгкостью настроить вашу систему и рабочий стол<br>
<a>СЕТЬ И ИНТЕРНЕТ</a><br>
Remmina — клиент удалённого рабочего стола, для подключения к рабочих столам удалённых машин, работающих как в Linux, так и в Windows<br>
Firefox  - веб-браузер<br>
Opera - веб-браузер<br>
Pidgin — клиент мгновенных сообщений, поддерживающий много протоколов (Jabber, XMPP, ICQ и др.)<br>
<a>ОБРАЗОВАТЕЛЬНЫЕ</a><br>
Step - виртуальный симулятор физических процессов<br>
Phun - виртуальный симулятор физических процессов с возможностью использования объектов разного типа (жидкости, газ и т.д.) <br>
Stellarium - виртуальный планетарий <br>
Сelestia — симулятор Вселенной, исследование пространства<br>
Kstars — настольный планетарий<br>
Kalzium — периодическая система элементов Менделеева<br>
Marble — настольный виртуальный глобус<br>
Kmplot — мощный объектно-ориентированный векторный графопостроитель<br>
Kalgebra — графический алгебраический вычислитель с поддержкой 3D-графиков <br>
Kig — программа интерактивной геометрии<br>
Scilab - пакет прикладных математических программ, предоставляющий мощное открытое окружение для инженерных (технических) и научных расчётов.<br>
Ktouch — клавиатурный тренажёр<br>
Step — интерактивный физический симулятор<br>
Kturtle — образовательная среда программирования<br>
<a>АУДИО И ВИДЕО</a><br>
Avidemux - видеоредактор<br>
Kdenlive  - нелинейный видеоредактор<br>
PiTiVi — нелинейный аудио/видеоредактор<br>
Audacity - аудио-редактор<br>
Totem - видеопроигрыватель<br>
VLC — мощный видеопроигрыватель, видеозахват с внешних устройств<br>
<a>Кроме этого в комплект установки входят:</a><br>
Установка шрифтов Microsoft (Times, Arial, Verdana, Courier и др.). <br>
Установка flash-плагина для Firefox для проигрывания флэш-анимаций.<br>
Аудио и видео кодеки.<br>
Приложение для сканирования изображений Xsane.<br>
приложение для работы с web-камерой Cheese.<br>
поддержка протокола доступа к файлам и папкам из Windows – Samba.<br>
Wine -поддержка запуска Windows приложений в Linux.<br>
Добавлена поддержка 3G модемов МЕГАФОН, БИЛАЙН, МТС.<br>
Добавлены галереи в OpenOffice.org.<br>
Поддержка работы с архивами любого формата (7z, zip, rar, bz2, gz, tar и др.)<br>
На рабочий стол были добавлены электронные версии книг по каждой из программ, входящих в сборку. <br>
Так же, в этой сборке были добавлены драйвера для наиболее распространенных моделей сканеров и принтеров. Большинство 
оборудования будет работать прямо после установки дистрибутива. Особо хочется отметить, <a>что существующие в школах 
принтеры EPSON 6200L, которые всегда вызывают проблему при работе в новых операционных системах  – будут успешно работать.</a>
В сборке в локальном репозитории имеются драйвера для  большинства используемых в учебных заведениях видеокарт 
от nVidia, ATI, Intel GMA. После установки драйвера устанавливаются автоматически или предлагается установить нужный драйвер.<br>
Для управления эффектами 3D-стола CompizFusion  добавлен менеджер CompizConfig.<br>
Установленный оконный декоратор Emerald позволит сделать красивый внешний вид рабочего стола и приложений. <br>
Дополнительно установлены две темы оформления среды GNOME – Balanzan и AquaDreams.<br>
Интерактивная доска UBT-T780 Panasonic будет работать сразу после установки системы. В комплекте имеется программа 
для калибровки доски. Если в школе есть интерактивные доски StarBoard Hitachi, приставки Mimio XI – то всё это 
оборудование также успешно будет работать после установки дополнительного программного обеспечения.<br>
Устанавливается OMS-плейер для работы с электронными образовательными ресурсами ФЦИОР.<br>
Сразу после установки на рабочем столе находится документация по использованию Ubuntu и установленного программного обеспечения.
И многое другое.<br>

<a>Глоссарий</a><br>
1. FLOSS, или Free/Libre and Open-Source Software — категория программного обеспечения, включает в себя как свободное, так и открытое программное обеспечение. В английском языке слово free значит и «свободный», и «бесплатный»; поэтому в термин включено слово libre (фр. «свободный»), чтобы подчеркнуть, что речь идет именно о свободном ПО, а не о freeware. Считается, что термин изобрёл Rishab Aiyer Ghosh(англ.) в 2001 г. Сокращение FLOSS широко используется в сообществе открытого исходного кода и в правительственных структурах Европейского союза; власти США предпочитают термин FOSS, без libre.<br>
2. Front-end and back-end -  обобщенные термины, которые относятся к начальной и конечной стадии процесса. Многие программы делятся концептуально на front-and back-end, но в большинстве случаев "back-end"  спрятан от пользователя. Однако, иногда программы пишутся, чтобы обслуживать другую. уже существующую программу просто как «front-end», например часто это графический пользовательский интерфейс (GUI), построенный как верхний слой интерфейса командной строки.<br>
3. Unity — свободная оболочка для среды рабочего стола GNOME, разрабатываемая компанией Canonical для операционной системы Ubuntu.<br>
4. GNOME — акроним от англ. GNU Network Object Model Environment («сетевая объектная среда GNU»). GNOME — свободная среда рабочего стола для Unix-подобных операционных систем. GNOME является частью и официальной рабочей средой проекта GNU. Разработчики GNOME ориентируются на создание полностью свободной среды, доступной всем пользователям вне зависимости от их уровня технических навыков, физических ограничений и языка, на котором они говорят. В рамках проекта GNOME разрабатываются как приложения для конечных пользователей, так и набор инструментов для создания новых приложений, тесно интегрируемых в рабочую среду.<br>
5. KDE (от англ. K Desktop Environment) — свободная среда рабочего стола для UNIX-подобных операционных систем. Построена на основе кросс-платформенного инструментария разработки пользовательского интерфейса Qt. Работает преимущественно под UNIX-подобными операционными системами, которые используют графическую подсистему X Window System. <br>
6. LinuxMCE – (Linux Media Center Etition) свободное дополнение к GNU/Linux дистрибутиву Kubuntu, которое позволяет использовать персональный компьютер в качестве домашнего кинотеатра в соответствии с концепцией HTPC. LinuxMCE не является автономным приложением, представляя собой полноценную HTPC-(аббревиатура от англ. Home Theatre Personal Computer) — концепция построения домашнего кинотеатра на основе персонального компьютера) ориентированную операционную систему. В число стандартных функций входят воспроизведение и запись видео и аудио материалов, поддержка дистанционного управления при помощи Bluetooth или web-интерфейса, телефонная система с поддержкой видеоконференций, а так же система автоматизированного управления домом («умный дом»). Операционная система LinuxMCE чрезвычайно легка в установке и использовании, от пользователя требуется лишь наличие элементарных навыков работы с компьютером.<br>
7. MythTV – это FOSS цифровой видео рекодер (DVR), который распространяется под лицензией GNU GPL. В разработке с 2002 года. Сетевая архитектура MythTV реализует концепцию «клиент-сервер» и состоит из двух уровней: серверного (backend) и клиентского (frontend). Простая конфигурация состоит из одного сервера, обслуживающего одного клиента, расположенного на том же компьютере. Сложная конфигурация состоит из множества серверов и клиентов, работающих на нескольких компьютерах, внешних медиа-модулях или игровых приставках.<br>
8. OCR - Оптическое распознавание символов (англ. Optical Character Recognition, OCR) — механическая или электронная конвертация изображений символов и букв в текст, редактируемый на компьютере. Перевод осуществляется программным путём, после получения изображения со сканера или фото.<br>
9. Online - Онлайн (англ. online, от англ. on line — русск. на линии) — «находящийся в состоянии подключения». Первоначально использовалось только в отношении коммуникационного оборудования для указания на режим связи. В отношении ПО почти всегда означает «подключённый к Интернету» или функционирующий только при подключении к Интернету. Также — «происходящее в Интернете», «существующее в Интернете». К примеру «онлайн-банкинг», «онлайн-магазин», «онлайн-казино», «онлайн-игра». В этих значениях часто употребляется также прилагательное онлайновый.<br>
10. root - (от англ. root — корень; читается «рут»), или су́перпо́льзователь — это специальный аккаунт в UNIX-подобных системах с идентификатором (UID, User IDentifier) 0, владелец которого имеет право на выполнение всех без исключения операций.<br>
11. Wine – (читается «вайн») это уровень трансляции (загрузчик программы) способный запускать Windows приложения на Linux и других POSIX совместимых операционных системах. Windows приложения запускаются в Wine, действуя как родные программы, выполняются без эмуляции и выглядят на рабочем столе как и все другие приложения.<br>
12. Открытое программное обеспечение (англ. open source software) — это программное обеспечение с открытым исходным кодом. Исходный код создаваемых программ открыт, то есть доступен для просмотра и изменения. Это позволяет использовать уже созданный код для создания новых версий программ для исправления ошибок и, возможно, помочь в доработке открытой программы. «Открытая» лицензия не требует, чтобы открытое ПО предоставлялось бесплатно. Многие из наиболее успешных проектов открытого ПО, тем не менее, бесплатны. Открытое программное обеспечение имеет большие перспективы в России в связи с принятием правительством и президентом РФ решений по обеспечению национальной безопасности в сфере ИТ на основе внедрения открытого и свободного ПО в государственные и бюджетные организации.<br>
13. Блог - (англ. blog, от «web log», «сетевой журнал или дневник событий») — это веб-сайт, основное содержимое которого — регулярно добавляемые записи, изображения или мультимедиа. Для блогов характерны недлинные записи вре́менной значимости, отсортированные в обратном хронологическом порядке (последняя запись сверху). Отличия блога от традиционного дневника обусловливаются средой: блоги обычно публичны и предполагают сторонних читателей, которые могут вступить в публичную полемику с автором (в отзывах к блог-записи или своих блогах).<br>
14. Бло́ггер - (бло́герами) называют людей, ведущих блог. Совокупность всех блогов Сети принято называть блогосферой. По авторскому составу блоги могут быть личными, групповыми (корпоративными, клубными…) или общественными (открытыми). По содержанию — тематическими или общими.<br>
15. Ве́ндор — это компания-поставщик брэнд-продуктов, сервисов и услуг, под чьей торговой маркой выпускается продукция (например, Intel, Compaq, 3Com). Вендор — юридическое или физическое лицо, носитель торговой марки (словарь бизнес-терминов).<br>
16. Дистрибути́в (от англ. distribute — распространять) — это форма распространения программного обеспечения. Дистрибутив обычно содержит программы для начальной инициализации системы (в случае дистрибутива операционной системы — инициализация аппаратной части, загрузка урезанной версии системы и запуск программы-установщика).<br>
17. Проприета́рное, частное или собственническое программное обеспечение (англ. proprietary software) — программное обеспечение, являющееся частной собственностью авторов или правообладателей и не удовлетворяющее критериям свободы ПО (речь именно о свободе, а не просто открытости ПО) и, с позиции Фонда свободного ПО, при этом не являющееся полусвободным ПО. Правообладатель сохраняет за собой монополию на его использование, копирование и модификацию, полностью или в существенных моментах. Часто проприетарным называют любое несвободное ПО, включая полусвободное<br>
18. Репозито́рий — место, где хранятся и поддерживаются какие-либо данные. Чаще всего данные в репозитории хранятся в виде файлов, доступных для дальнейшего распространения по сети.<br>
19. Юзеби́лити – (анг. usability) – это термин для обозначения простоты, с которой люди могут использовать определенный инструментарий или другие сделанные человеком объекты, для того, чтобы достигнуть определенных целей. Юзебилити в понятии системы человек–компьютер подразумевает качественный атрибут который оценивает насколько прост пользовательский интерфейс, который используется.<br>
</p>

