<?php $this->pageTitle=Yii::app()->name; ?>
<style>
   div {
   #justify { text-align: justify; }
    
  </style>
<h1>Добро пожаловать в <i><?php echo CHtml::encode(Yii::app()->name); ?></i></h1>

<p id=ubuntulink align="justify">Цель проекта: создание парка услуг для пользователей свободного программного 
обеспечения и популяризация использования в образовательном процессе операционной системы <a>Ubuntu Linux</a>.<br><br>

Правительственная комиссия РФ по высоким технология и инновациям в числе  приоритетных направлений развития экономики России одобрила создание национальной программной платформы (НПП), основанной на использовании СПО (свободное программное обеспечение) и операционной системы на основе ядра Linux.
Технологии с открытым кодом быстро распространяются во всем мире. В России принято постановление о переводе на такое ПО всех государственных учреждений к 2015 г.  За последний год число внедрений Ubuntu на предприятиях выросло на 300%
На сегодняшний день операционная система Ubuntu – является самым популярным Linux-дистрибутивом в мире и не требует от организаций покупать лицензии на каждый компьютер, где устанавливается этот дистрибутив. Ubuntu предназначена для работы на персональных компьютерах, ноутбуках, лаптопах, нетбуках и серверах и включает все необходимые приложения для повседневной работы.
Ввиду того, что произошло достаточное отставание в информационных технологиях в области создания собственных операционных систем, дефицитом квалифицированных кадров в области СПО, – значимым является поддержка внедрения современных информационных технологий на базе СПО в государственных и учебных организациях.
Предлагается оказание услуг по технической поддержки СПО на базе Ubuntu Linux как серверов, так и рабочих станций, обучение пользователей работе в системе, консалтинг по направлениям как минимизировать риски при внедрении СПО в образовательных учреждения, а так же проведение анализа и выработка рекомендаций по предупреждению организационных и технических трудностей на пути миграции к СПО.
<br><br>
Обратитесь к нам и узнайте, как переход с Windows на Ubuntu Linux может помочь в увеличении гибкости и расширении выбора платформы, в повышении защиты и надёжности, а также сокращении расходов. 
Мы всегда готовы к открытому диалогу и сотрудничеству. 
</p>
<!--123435-->
